In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv("ML 11_mall customers.csv")
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [3]:
df.drop('CustomerID', axis=1, inplace=True)

In [4]:
df=df.rename(columns={'Annual Income (k$)' : 'Income', 'Spending Score (1-100)': 'Score'})

In [5]:
df.head()

   Gender  Age  Income  Score
0    Male   19      15     39
1    Male   21      15     81
2  Female   20      16      6
3  Female   23      16     77
4  Female   31      17     40

In [6]:
df_2=df.copy()
df_3=df.copy()

# Apply K-Means Cluster

In [7]:
from sklearn.cluster import KMeans
km=KMeans()
y_pred=km.fit_predict(df[['Age','Income','Score']])

In [8]:
df['cluster_1']=y_pred
df

     Gender  Age  Income  Score  cluster_1
0      Male   19      15     39          5
1      Male   21      15     81          4
2    Female   20      16      6          5
3    Female   23      16     77          4
4    Female   31      17     40          5
..      ...  ...     ...    ...        ...
195  Female   35     120     79          6
196  Female   45     126     28          1
197    Male   32     126     74          6
198    Male   32     137     18          1
199    Male   30     137     83          6

[200 rows x 5 columns]

In [9]:
centorid_1=centers=km.cluster_centers_  # Default value of clusters is 8
centorid_1                             # Centroid values

array([[ 27.10810811,  56.2972973 ,  49.67567568],
       [ 41.        , 109.7       ,  22.        ],
       [ 32.625     ,  80.375     ,  82.9375    ],
       [ 56.34090909,  53.70454545,  49.38636364],
       [ 25.27272727,  25.72727273,  79.36363636],
       [ 44.31818182,  25.77272727,  20.27272727],
       [ 33.        , 114.71428571,  78.42857143],
       [ 41.23076923,  79.26923077,  15.92307692]])

# Select Optimal Number of Cluster (Elbo Method)

In [10]:
wcsse = []

In [11]:
k_rng=range(1,15)
for k in k_rng:
    km2=KMeans(n_clusters=k)
    km2.fit(df[['Age','Income','Score']])
    wcsse.append(km2.inertia_)

C:\Users\REAZ\anaconda3\lib\site-packages\sklearn\cluster\_kmeans.py:881: UserWarning: KMeans is known to have a memory leak on Windows with MKL, when there are less chunks than available threads. You can avoid it by setting the environment variable OMP_NUM_THREADS=1.
  warnings.warn(

In [12]:
#wcsse

In [13]:
from kneed import KneeLocator
kn=KneeLocator(k_rng,wcsse, curve='convex', direction='decreasing')
kn.knee

5

# After Tuning (Cluster Size =5)

In [14]:
km_2=KMeans(n_clusters=5)

In [15]:
y_pred_2=km_2.fit_predict(df[['Age','Income','Score']])

In [16]:
df['cluster_2']=y_pred_2
df

     Gender  Age  Income  Score  cluster_1  cluster_2
0      Male   19      15     39          5          3
1      Male   21      15     81          4          0
2    Female   20      16      6          5          3
3    Female   23      16     77          4          0
4    Female   31      17     40          5          3
..      ...  ...     ...    ...        ...        ...
195  Female   35     120     79          6          4
196  Female   45     126     28          1          1
197    Male   32     126     74          6          4
198    Male   32     137     18          1          1
199    Male   30     137     83          6          4

[200 rows x 6 columns]

In [17]:
centorid_2=km_2.cluster_centers_
centorid_2

array([[25.27272727, 25.72727273, 79.36363636],
       [40.66666667, 87.75      , 17.58333333],
       [42.9375    , 55.0875    , 49.7125    ],
       [45.2173913 , 26.30434783, 20.91304348],
       [32.69230769, 86.53846154, 82.12820513]])